DIYbitcoin/kiss-signer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# Stack canaries. IDF defaults this to NONE, which is a decision nobody in this
# repo made and one that reads as deliberate once it is committed in four
# sdkconfigs. The code that parses attacker-supplied bytes -- PSBTs off an SD
# card, UR frames off the camera, firmware descriptors -- is all in main/, and
# main/ was the part compiling without canaries while the vendored libwally
# opts into them. STRONG rather than ALL: it covers every function with a local
# array or an address-taken local, which is the shape of every parser here,
# without the size and speed cost of instrumenting arithmetic-only leaves.
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=20480
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_FREERTOS_HZ=1000
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# The bootloader is loaded into 0x2000..<table>, so the table offset IS its
# size budget. At the stock 0x8000 that is 24576 bytes and a flash-encryption
# bootloader is ~34880, so the ceiling was not survivable. 0x10000 gives it
# 57344 and matches partitions_encrypted.csv, which had already moved for the
# same reason -- one layout, so nvs is at one offset. See partitions.csv.
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# --- SD firmware update ---
# Rollback is what makes writing firmware on a signer survivable. The freshly
# written slot boots PENDING_VERIFY; main.c calls
# esp_ota_mark_app_valid_cancel_rollback() once the home screen is up, and any
# path that reboots before that -- a crash, a hang the watchdog kills, a power
# cut -- hands the device back to the slot that was working. Needs no key and
# costs nothing, so it is on in every lane including dev builds.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# The image being installed is verified against the running app's own signature
# block before esp_ota_end will accept it. That verification is deliberately NOT
# turned on here: CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT requires a signing
# key at build time, and putting it in the defaults means a plain `idf.py build`
# fails on any machine that does not hold the release private key. It belongs to
# the release lane, where the key exists -- see docs/installer/SIGNING.md. A
# build without it still runs the update flow, and kiss_fw_available() refuses
# to install, saying so on screen, rather than accepting an unsigned image.

# --- camera (step 2 spike): OV02C10 over MIPI-CSI (the sensor Guition actually
# ships on this board's ribbon; SCCB addr 0x36 on the shared touch I2C bus),
# RAW10 1920x1080 2-lane, ISP -> RGB565 ---
CONFIG_CAMERA_OV02C10=y
CONFIG_CAMERA_OV02C10_MIPI_RAW10_1288x728_30FPS=y
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=n

# The ISP pipeline controller is the task that reads the ISP's own statistics
# every frame and drives sensor exposure, gain and white balance from them.
# Without it the tuning file is inert, the sensor holds exp_def (1132 lines,
# 31.6 ms) for the whole session, and white balance never moves off default.
#
# It is OFF, and it is off on evidence, not caution. Turned on, the AGC drove
# exposure to the sensor's floor of 8 lines, 223 us, and held it there while
# gain sat near the top of its map. The preview went dark, both numbers stayed
# put when the room light was switched on, and the camera entropy estimate fell
# from over 6.0 bits to 3.5, far enough that seed creation could not complete.
# See VENDOR.kiss.md section 4. Everything else the pipeline needs is in place
# and stays in place: the tuning file is registered, tline_ns is filled in, and
# the sensor pedestal is zeroed. Flipping this back to y is the whole re-test.
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=n
CONFIG_LV_USE_QRCODE=y
CONFIG_FATFS_LFN_HEAP=y


# LVGL's bundled examples and demos, off. They compile on every build and link
# nothing: no code in main/ references them, so this buys build time and a
# smaller dependency surface, NOT firmware bytes -- worth stating plainly so
# nobody records it as an attack-surface reduction it is not.
#
# Set here rather than in sdkconfig / sdkconfig.release / sdkconfig.encrypted:
# those three are generated (the release lanes regenerate theirs from sdkconfig
# on every build) and idf.py rewrites sdkconfig, so a value written there is a
# value that comes back. Defaults is the only file that holds.
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
